Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()

Функция ПолучитьСписокДолжностей(Подразделение) Экспорт
	
	МассивДолжностей = Новый Массив;
	
	ТЧДолжности = Подразделение.Должности;
	
	Для Каждого ТекСтрока Из ТЧДолжности Цикл
		
		МассивДолжностей.Добавить(ТекСтрока.Должность.Наименование);
		
	КонецЦикла;
	
	Возврат МассивДолжностей;
	
КонецФункции

Функция ПолучитьСписокПредыдущихМестРаботыСотрудника(Сотрудник) Экспорт

	Массив = Новый Массив();	
	
	Для Каждого ТекСтрока Из Сотрудник.ТрудоваяКнижка Цикл
		
		Массив.Добавить(ТекСтрока.МестоРаботы);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
