
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//--ДЗ 1.5.3 -----
	Если Сотрудник.Родитель = Справочники.Сотрудники.Неприкасаемые Тогда
	
		Отказ = Истина;
	
	КонецЕсли;
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	СправочникОбъект =  Сотрудник.ПолучитьОбъект();
	
	//СправочникОбъект.Родитель = Справочники.Сотрудники.НайтиПоНаименованию("Работающие");
	СправочникОбъект.Родитель = Справочники.Сотрудники.Принятые;
	
	СправочникОбъект.Записать();
	
	//ДЗ 1.5.7
	СтрокаДолжность = Подразделение.Должности.Найти(Должность,"Должность");
	
	Если СтрокаДолжность = Неопределено Тогда
		
		Сообщить("В подразделении " + Подразделение + " нет такой должности " + Должность);
		Сообщить("Нельзя провести такой документ!");
		
		Возврат;
		
	КонецЕсли;
	
	Если СтавкаОклада > Должность.СтавкаОклада Тогда
		
		Сообщить("Ставка оклада по документу превышает ставку оклада должности!");
		
	КонецЕсли;
	
КонецПроцедуры




