
&НаКлиенте
Процедура ПолучитьКурс(Команда)
	
	АктуальныеДанныеПоВалюте = НаСервереМожноВызватьСКлиента.ПолучитьАктуальныеДанныеПоВалюте( 
	Элементы.Список.ТекущаяСтрока, ТекущаяДата());
	
	КурсЧислитель = АктуальныеДанныеПоВалюте.КурсЧислитель;
	КурсЗнаменатель = АктуальныеДанныеПоВалюте.КурсЗнаменатель;
	
	
	СтруктураСДаннымиТекущейСтроки = Элементы.Список.ТекущиеДанные;
	
	
	БуквенныйКод = СтруктураСДаннымиТекущейСтроки.БуквенныйКод;
	
	Текст = "Курс валюты " + БуквенныйКод + " по отношению к Национальной валюте на сегодня составляет "
	+ КурсЧислитель + " руб. за " + КурсЗнаменатель + " ед.";
	
	ПоказатьПредупреждение(
	Новый ОписаниеОповещения("ПолучитьКурсЗавершение", ЭтотОбъект)
	, Текст , 10 , "Сегодня " + ТекущаяДата() );
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурсЗавершение(ДополнительныеПараметры) Экспорт
	
	ПоказатьОповещениеПользователя("Курс показан");
	
КонецПроцедуры




