
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент();

	ПечатьРеализации(ПараметрКоманды, ТабДок);

	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьРеализации(Ссылка, ТабДок)
	
	//Если общий макет
	Макет = ПолучитьОбщийМакет("МакетРеализации");
	//или если макет привязан к объекту метаданных
	//Макет = Документы.Реализация.ПолучитьМакет("МакетРеализации");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");

	ТоварыОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ТоварыШапкаТаблицы");
	ТоварыОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ТоварыПодвалТаблицы");
	ТоварыОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("ТоварыДетали");
	
	УслугиОбластьШапкаТаблицы = Макет.ПолучитьОбласть("УслугиШапкаТаблицы");
	УслугиОбластьПодвалТаблицы = Макет.ПолучитьОбласть("УслугиПодвалТаблицы");
	УслугиОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("УслугиДетали");
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Реализация.Дата,
		|	Реализация.Номер,
		|	Реализация.Менеджер,
		|	ПРЕДСТАВЛЕНИЕ(Реализация.Менеджер),
		|	Реализация.Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(Реализация.Контрагент),
		|	Реализация.КонтактноеЛицо,
		|	ПРЕДСТАВЛЕНИЕ(Реализация.КонтактноеЛицо),
		|	Реализация.СуммаДокумента,
		|	Реализация.Склад,
		|	ПРЕДСТАВЛЕНИЕ(Реализация.Склад),
		|	Реализация.Товары.(
		|		Ссылка,
		|		ПРЕДСТАВЛЕНИЕ(Реализация.Товары.Ссылка),
		|		НомерСтроки,
		|		Номенклатура,
		|		ПРЕДСТАВЛЕНИЕ(Реализация.Товары.Номенклатура),
		|		ЕдиницаИзмерения,
		|		ПРЕДСТАВЛЕНИЕ(Реализация.Товары.ЕдиницаИзмерения),
		|		Серия,
		|		ПРЕДСТАВЛЕНИЕ(Реализация.Товары.Серия),
		|		Количество,
		|		Цена,
		|		Сумма),
		|	Реализация.Услуги.(
		|		Ссылка,
		|		ПРЕДСТАВЛЕНИЕ(Реализация.Услуги.Ссылка),
		|		НомерСтроки,
		|		Номенклатура,
		|		ПРЕДСТАВЛЕНИЕ(Реализация.Услуги.Номенклатура),
		|		Количество,
		|		Цена,
		|		Сумма)
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	
		ТабДок.Вывести(ТоварыОбластьШапкаТаблицы);
	
		ТоварыВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписи.Товары.Выбрать();
	
		Пока ТоварыВыборкаДетальныеЗаписи.Следующий() Цикл
			ТоварыОбластьДетальныхЗаписей.Параметры.Заполнить(ТоварыВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ТоварыОбластьДетальныхЗаписей);
		КонецЦикла;
	
		ТабДок.Вывести(ТоварыОбластьПодвалТаблицы);
	
		ТабДок.Вывести(УслугиОбластьШапкаТаблицы);
	
		УслугиВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписи.Услуги.Выбрать();
	
		Пока УслугиВыборкаДетальныеЗаписи.Следующий() Цикл
			УслугиОбластьДетальныхЗаписей.Параметры.Заполнить(УслугиВыборкаДетальныеЗаписи);
			ТабДок.Вывести(УслугиОбластьДетальныхЗаписей);
		КонецЦикла;
	
		ТабДок.Вывести(УслугиОбластьПодвалТаблицы);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

