
&НаСервереБезКонтекста
Процедура ЧтениеВсехДокументовНаСервере()

	 Выборка = Документы.ПоступлениеТоваров.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	ТекКонтрагент = Выборка.Контрагент;
		
		Сообщить(ТекКонтрагент);
		
		Для каждого ТекСтрока Из Выборка.Товары Цикл
		
			 Сообщить(ТекСтрока.Номенклатура);
		
		КонецЦикла; 
		
	 
	 КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеВсехДокументов(Команда)
	ЧтениеВсехДокументовНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЧтениеВсехДокументовТабличнаяМодельНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Контрагент,
		|	ПоступлениеТоваров.Товары.(
		|		Номенклатура,
		|		Количество
		|	)
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекКонтрагент = Выборка.Контрагент;
		
		Сообщить(ТекКонтрагент);
		
		ВыборкаДетальныеЗаписи = Выборка.Товары.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			 Сообщить(ВыборкаДетальныеЗаписи.Номенклатура);
		
		КонецЦикла; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеВсехДокументовТабличнаяМодель(Команда)
	ЧтениеВсехДокументовТабличнаяМодельНаСервере();
КонецПроцедуры
