
&НаСервереБезКонтекста
Процедура ЧтениеВсехЭлементовНаСервере()

	 Выборка = Справочники.Номенклатура.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	Переменная = Выборка.Наименование;
		
		Сообщить(Переменная);
	 
	 КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеВсехЭлементов(Команда)
	ЧтениеВсехЭлементовНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МодификацияДанныхНаСервере()

	ПредопределеннаяГруппа = Справочники.Номенклатура.ДляПереноса;
	
	Выборка = Справочники.Номенклатура.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = ПредопределеннаяГруппа Тогда
		
			 Продолжить;
		
		 КонецЕсли;
		 
		 ПолученныйОбъект = Выборка.ПолучитьОбъект();
		 
		 ПолученныйОбъект.Родитель = ПредопределеннаяГруппа;
		 
		 ПолученныйОбъект.Записать();
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МодификацияДанных(Команда)
	МодификацияДанныхНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Практикум2НаСервере()

	
	Пока Справочники.Номенклатура.Выбрать().Следующий() Цикл
		
		 Сообщить("Практикум");
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Практикум2(Команда)
	Практикум2НаСервере();
КонецПроцедуры
