
&НаКлиенте
Процедура ПолучитьКодИНаименованиеВалюты(Команда)
	
	Данные = Новый Структура;
	Данные.Вставить("Наименование");
	Данные.Вставить("Код");
	Данные.Вставить("БуквенныйКод");
	
	Валюта = Элементы.Список.ТекущиеДанные.ВалютаРасчетов;
	
	ПолучитьКодИНаименованиеВалютыНаСервере(Валюта, Данные);
	
	Сообщить("Наименование валюты " + Данные.Наименование);
	Сообщить("Код валюты " + Данные.Код);
	Сообщить("Буквенный код валюты " + Данные.БуквенныеКод);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьКодИНаименованиеВалютыНаСервере(Валюта, Данные)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Валюты.Код,
		|	Валюты.Наименование,
		|	Валюты.БуквенныйКод
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Данные.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		Данные.Код = ВыборкаДетальныеЗаписи.Код;
		Данные.БуквенныйКод = ВыборкаДетальныеЗаписи.БуквенныйКод;

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
