Функция ПолучитьНаименованиеОрганизации() Экспорт

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()

Функция ЗаполнитьКурсВалютыНаДату(Данные) Экспорт
	
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(Данные.КодВалюты);

	Если ЗначениеЗаполнено(СсылкаНаВалюту) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Данные.Дата;
		ЗаписьРегистраСведений.Валюта = СсылкаНаВалюту;
		ЗаписьРегистраСведений.Курс = Данные.Курс;
		ЗаписьРегистраСведений.Кратность = ?(Данные.Кратность = 0, 1, Данные.Кратность);
		ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(Данные.ФИО, Ложь);

		ЗаписьРегистраСведений.Записать();

		СпрВалютыОбъект = СсылкаНаВалюту.ПолучитьОбъект();
		СпрВалютыОбъект.Курс = Данные.Курс;
		СпрВалютыОбъект.Кратность = Данные.Кратность;
		СпрВалютыОбъект.ДатаКурса = Данные.Дата;
		СпрВалютыОбъект.Записать();
		
		Возврат СсылкаНаВалюту.БуквенныйКод;

	КонецЕсли;

КонецФункции


Процедура ЗаменитьОтветственного(СтарыйОтветственный, НовыйОтветственный) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = СтарыйОтветственный Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НовыйОтветственный;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры

Функция СформироватьСписокДолжностей(Подразделение) Экспорт
	
	МассивДолжностей = Новый Массив;
	
	ТЧДолжности = Подразделение.Должности;
	
	Для Каждого ТекСтрока Из ТЧДолжности Цикл
		
		МассивДолжностей.Добавить(ТекСтрока.Должность);
		
	КонецЦикла;
	
	Возврат МассивДолжностей;
	
КонецФункции
Функция ПолучитьСписокДолжностей(Подразделение) Экспорт
	
	МассивДолжностей = Новый Массив;
	
	ТЧДолжности = Подразделение.Должности;
	
	Для Каждого ТекСтрока Из ТЧДолжности Цикл
		
		МассивДолжностей.Добавить(ТекСтрока.Должность.Наименование);
		
	КонецЦикла;
	
	Возврат МассивДолжностей;
	
КонецФункции

Функция ПолучитьСписокПредыдущихМестРаботыСотрудника(Сотрудник) Экспорт

	Массив = Новый Массив();	
	
	Для Каждого ТекСтрока Из Сотрудник.ТрудоваяКнижка Цикл
		
		Массив.Добавить(ТекСтрока.МестоРаботы);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокКонтактныхЛицКонтрагента(Контрагент) Экспорт
	
	Массив = Новый Массив();
	
	ВыборкаКонтактныеЛица = Справочники.КонтактныеЛица.Выбрать(,Контрагент);
	
	Пока ВыборкаКонтактныеЛица.Следующий() = Истина Цикл
		
		Массив.Добавить(ВыборкаКонтактныеЛица.Наименование);
		
	КонецЦикла;
	
	Возврат Массив;
	
	
КонецФункции

// Установить цену.
// 
// Параметры:
//  Параметры - Структура
// Ключи: Номенклатура, Контрагент, Цена, Дата
Процедура УстановитьЦену(Параметры) Экспорт
	
	Возврат; //Это регистр теперь подчинен регистратору
	
//	ЗаписьРегистраСведений = РегистрыСведений.НашиЦены.СоздатьМенеджерЗаписи();
//	ЗаписьРегистраСведений.Период = Параметры.Дата;
//	ЗаписьРегистраСведений.Номенклатура = Параметры.Номенклатура;
//	ЗаписьРегистраСведений.Контрагент = Параметры.Контрагент;
//	ЗаписьРегистраСведений.Цена = Параметры.Цена;
//
//	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры
// Описание
// 
// Параметры:
// 	СсылкаНаВалюту - СправочникСсылка - Ссылка на справочник "Валюты"
// 	Дата - Дата
// Возвращаемое значение:
// 	Структура - Описание:
// * Курс - Число - 
// * Кратность - Число -
Функция ПолучитьАктуальныеДанныеПоВалюте(СсылкаНаВалюту, Дата) Экспорт

	Вернем = Новый Структура;

	Вернем.Вставить("Курс", 0);

	Вернем.Вставить("Кратность", 0);


	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &СсылкаНаВалюту) КАК КурсыВалютСрезПоследних";

	Запрос.УстановитьПараметр("СсылкаНаВалюту", СсылкаНаВалюту);

	Запрос.УстановитьПараметр("Дата", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если (ВыборкаДетальныеЗаписи.Следующий() = Истина) Тогда

		Вернем.Курс = ВыборкаДетальныеЗаписи.Курс;

		Вернем.Кратность = ВыборкаДетальныеЗаписи.Кратность;

	КонецЕсли;

	Возврат Вернем;

КонецФункции // ПолучитьАктуальныеДанныеПоВалюте()
