
&НаКлиенте
Процедура ПолучитьСписокКонтактныхЛицКонтрагента(Команда)

	Массив = ПолучитьСписокКонтактныхЛицКонтрагентаСервер(Контрагент);

	Номер = 1;

	Для Каждого Элемент Из Массив Цикл
		
		Сообщение = Новый СообщениеПользователю();
		
		Сообщение.Текст = "Контактное лицо " + Номер + ") " + Элемент;
		
		Сообщение.Сообщить();
		
		Номер = Номер + 1;
		
	КонецЦикла;


КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтактныхЛицКонтрагентаСервер(Контрагент)
	
	Массив = Новый Массив();
	
	//Алгоритм получения списка контактных лиц
	ВыборкаКонтактныеЛица = Справочники.КонтактныеЛица.Выбрать(,Контрагент);
	
	Пока ВыборкаКонтактныеЛица.Следующий() = Истина Цикл
		
		Массив.Добавить(ВыборкаКонтактныеЛица.Наименование);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции