
&НаСервере
Процедура ЗаменитьОтветственногоНаСервере()

	НовыйОтветственный = Справочники.Сотрудники.НайтиПоКоду(ТабельныйНомерМОЛ);
	Склад = Справочники.Склады.НайтиПоНаименованию(НаименованиеСклада);

	СкладОбъект = Склад.ПолучитьОбъект();
	СкладОбъект.Ответственный = НовыйОтветственный;

	Попытка
		СкладОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОтветственного(Команда)
	ЗаменитьОтветственногоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОтветственногоНаВсехСкладах(Команда)

	Данные = Новый Структура;
	Данные.Вставить("НовыйОтветственный", НовыйОтветственный);
	Данные.Вставить("СтарыйОтветственный", СтарыйОтветственный);

	ЗаменитьОтветственногоНаВсехСкладахСервер(Данные);
	
	ПоказатьОповещениеПользователя("Изменены ответственные на складах");
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаменитьОтветственногоНаВсехСкладахСервер(Данные)
	
	Выборка = Справочники.Склады.Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Выборка.Ответственный = Данные.СтарыйОтветственный Тогда

			СкладОбъект = Выборка.ПолучитьОбъект();

			СкладОбъект.Ответственный = Данные.НовыйОтветственный;

			Попытка
				СкладОбъект.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;

		КонецЕсли;

	КонецЦикла;
	 	
КонецПроцедуры