
&НаКлиенте
Процедура ЗаменитьОтветственного(Команда)

	Данные = Новый Структура;
	Данные.Вставить("СтарыйОтветственный", СтарыйОтветственный);
	Данные.Вставить("НовыйОтветственный", НовыйОтветственный);

	ЗаменитьОтветственногоСервер(Данные);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаменитьОтветственногоСервер(Данные)
	
	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = Данные.СтарыйОтветственный Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = Данные.НовыйОтветственный;
				 
				 Попытка
					 СкладОбъект.Записать();
				 Исключение
				 	Сообщить(ОписаниеОшибки());
				 КонецПопытки;
			 
			 КонецЕсли;
	 
	 КонецЦикла;
	 	
КонецПроцедуры