

&НаКлиенте
Процедура Установить(Команда)
	
	Данные = Новый СписокЗначений();
	Данные.Добавить(Период);
	Данные.Добавить(Валюта);
	Данные.Добавить(КурсЧислитель);
	Данные.Добавить(КурсЗнаменатель);
	Данные.Добавить(Сотрудник);
	
	УстановитьСервер(Данные, БуквенныйКод);
	
	Сообщить("Курс валюты " + БуквенныйКод + " установлен");

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСервер(Данные, БуквенныйКод)
		
	Если ЗначениеЗаполнено(Данные.Получить(1).Значение) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.ОтносительныеКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Данные.Получить(0).Значение;
		ЗаписьРегистраСведений.Валюта = Данные.Получить(1).Значение;
		ЗаписьРегистраСведений.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		ЗаписьРегистраСведений.КурсЧислитель = Данные.Получить(2).Значение;
		ЗаписьРегистраСведений.КурсЗнаменатель = ?(Данные.Получить(3).Значение = 0, 1, Данные.Получить(3).Значение);
		ЗаписьРегистраСведений.Ответственный = Данные.Получить(4).Значение;

		Попытка
			ЗаписьРегистраСведений.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		
		БуквенныйКод =  Данные.Получить(1).Значение.БуквенныйКод;

	КонецЕсли;
	
	
КонецПроцедуры