

&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьСервер();
	
	Сообщить("Курс валюты " + БуквенныйКод + " установлен");

КонецПроцедуры

&НаСервере
Процедура УстановитьСервер()
		
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(КодВалюты);

	Если ЗначениеЗаполнено(СсылкаНаВалюту) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.ОтносительныеКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Дата;
		ЗаписьРегистраСведений.Валюта = СсылкаНаВалюту;
		ЗаписьРегистраСведений.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		ЗаписьРегистраСведений.КурсЧислитель = КурсЧислитель;
		ЗаписьРегистраСведений.КурсЗнаменатель = ?(КурсЗнаменатель = 0, 1, КурсЗнаменатель);
		ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(ФИООтветственного, Ложь);

		Попытка
			ЗаписьРегистраСведений.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Если СсылкаНаВалюту.ДатаКурса > Дата Тогда
			Возврат; //ДЗ
		КонецЕсли;


		СпрВалютыОбъект = СсылкаНаВалюту.ПолучитьОбъект();
		СпрВалютыОбъект.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		СпрВалютыОбъект.КурсЧислитель = КурсЧислитель;
		СпрВалютыОбъект.КурсЗнаменатель = КурсЗнаменатель;
		СпрВалютыОбъект.ДатаКурса = Дата;

		Попытка
			СпрВалютыОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		БуквенныйКод =  СсылкаНаВалюту.БуквенныйКод;

	КонецЕсли;
	
	
КонецПроцедуры