
&НаКлиенте
Процедура УстановитьЦену(Команда)

	УстановитьЦенуСервер();
	
	Сообщить("Механизм в этой обработке устарел. 
	|Теперь для измерения данных надо проводить документ ""Установка цен""!");

КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуСервер()
	
	//Этот регистра теперь подчинен регистратору!
	//Алгоритм установки цен
//	ЗаписьРегистраСведений = РегистрыСведений.НашиЦены.СоздатьМенеджерЗаписи();
//	ЗаписьРегистраСведений.Период = Дата;
//	ЗаписьРегистраСведений.Номенклатура = Номенклатура;
//	ЗаписьРегистраСведений.Контрагент = Контрагент;
//	ЗаписьРегистраСведений.Цена = Цена;
//
//	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры
