
&НаСервереБезКонтекста
Процедура _1_ДанныеОКонтактныхЛицахНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛица.Наименование КАК ФИО,
		|	КонтактныеЛица.Телефон,
		|	КонтактныеЛица.Владелец.НаименованиеПолное КАК Контрагент
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Сообщить("ФИО / Телефон / Контрагент :" + ВыборкаДетальныеЗаписи.ФИО 
		+ " / " + ВыборкаДетальныеЗаписи.Телефон + " / " + ВыборкаДетальныеЗаписи.Контрагент);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура _1_ДанныеОКонтактныхЛицах(Команда)
	_1_ДанныеОКонтактныхЛицахНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура _2_ПятьНаиболееДорогихТоваровНаСервере()

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровТовары.Номенклатура,
		|	МАКСИМУМ(ПродажаТоваровТовары.Цена) КАК Цена
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 5
		|	ВременнаяТаблица.Номенклатура,
		|	ВременнаяТаблица.Цена КАК Цена
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	Цена УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Сообщить("Товар \ Цена :" + ВыборкаДетальныеЗаписи.Номенклатура + " \ "
		+ ВыборкаДетальныеЗаписи.Цена);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура _2_ПятьНаиболееДорогихТоваров(Команда)
	_2_ПятьНаиболееДорогихТоваровНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура _3_ПоставкиКонтрагентовНаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваров.Контрагент КАК Контрагент,
		|	ПродажаТоваров.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПродажаТоваров КАК ПродажаТоваров
		|ИТОГИ
		|	СУММА(СуммаДокумента)
		|ПО
		|	Контрагент ТОЛЬКО ИЕРАРХИЯ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл

		Сообщить("Группа \ Сумма :" + ВыборкаКонтрагент.Контрагент + " \ " + ВыборкаКонтрагент.СуммаДокумента);
		
		ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			Сообщить("Контрагент \ Сумма :" + ВыборкаДетальныеЗаписи.Контрагент
			+ " \ " + ВыборкаДетальныеЗаписи.СуммаДокумента);
		
		КонецЦикла;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура _3_ПоставкиКонтрагентов(Команда)
	_3_ПоставкиКонтрагентовНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура _4_ПятьПродоваемыхТоваровНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровТовары.Номенклатура,
		|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 5
		|	ВременнаяТаблица.Номенклатура,
		|	ВременнаяТаблица.Количество КАК Количество
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Номенклатура \ Количество :" + ВыборкаДетальныеЗаписи.Номенклатура
		+ " \ " + ВыборкаДетальныеЗаписи.Количество);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры

&НаКлиенте
Процедура _4_ПятьПродоваемыхТоваров(Команда)
	_4_ПятьПродоваемыхТоваровНаСервере();
КонецПроцедуры
