
&НаКлиенте
Процедура ДанныеИзФормы(Команда)
	
	ЗначениеКонстанты = НаборКонстант.НаименованиеКомпании;
	
	ПоказатьОповещениеПользователя(ЗначениеКонстанты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ДанныеИзБазыНаСервере()
	
	ЗначениеКонстанты = Константы.НаименованиеКомпании.Получить();
	
	Возврат(ЗначениеКонстанты);
	
КонецФункции

&НаКлиенте
Процедура ДанныеИзБазы(Команда)
	
	ЗначениеКонстанты = ДанныеИзБазыНаСервере();
	
	ПоказатьОповещениеПользователя(ЗначениеКонстанты);
	
КонецПроцедуры
